angular.module("app").directive("session", [function () {
  return {
    restrict: "E",
    replace: true,
    templateUrl: "app/session/session.html",
    link: function ($scope, element, attrs) {
      //$scope.panels_left = [
      //  {
      //    "title": "Відшарування сітківки",
      //    "body": "Стандартна процедура (газ чи силікон – покази, переваги, недоліки). Ускладнені випадки (вітрео-ретинальна проліферація, техніка видалення епіретинальних і субретинальних  мембран, ретінотомія, ретіноектомія). Видалення внутрішньої пограничної мембрани – за і проти. Фотоциркляж – за і проти. Силіконова глаукома – як часто?, як запобігти?, що робити?"
      //  },
      //  {
      //    "title": "Діабетична ретінопатія",
      //    "body": "Покази до операції. Підготовка хворого до операції. Стандартна процедура (повітря, газ, силікон – переваги, недоліки). Видалення епіретинальних мембран. Чи можна щось лишати? Особливості лазерної коагуляції: де, скільки, як сильно? Ускладнені випадки, техніка. Видалення внутрішньої пограничної мембрани – за і проти, ФЕК – за і проти."
      //  },
      //  {
      //    "title": "Макулярна дірка",
      //    "body": "Стадії і покази. Техніка операції при довготривалих макулярних дірках. Механізм лікувальної дії видалення внутрішньої пограничної мембрани."
      //  }
      //];

      //$scope.panels_right = [
      //  {
      //    "title": "Травма і вітрео-ретинальна хірургія",
      //    "body": "Гемофтальм – покази до операції. Стороннє тіло – покази до транссклерального і трансвітреального видалення стороннього тіла. Травматична катаракта з розривом задньої капсули – чи можна обійтися без вітрео-ретинальної операції? Люксація кришталика. Способи фіксації ІОЛ. Ендофтальміт. Коли антибіотик, коли операція? Коли пошкоджено все. Все і зразу?"
      //  },
      //  {
      //    "title": "Дитяча патологія",
      //    "body": "Що може вітрео-ретинальний хірург? Діагностика ретінопатії недоношених. Коли лазер? Коли операція?"
      //  },
      //  {
      //    "title": "Ваша тема або окрема доповідь",
      //    "body": ""
      //  }
      //];


    }
  }
}]);
